OuWenJing/4/基于STM32 NODERED实验/6.NODERED平台控制LED灯实验/WiFi模块程序/USER/main.c
#include "stm32f1xx_hal.h"
#include "stm32f1xx.h"
#include "delay.h"
#include "Rs485.h"
#include "usart.h"
#include "timer.h"
#include "WiFi.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2020-03-19
*
*	版本： 		V2.0
*
*	说明： 		WiFi控制
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/
void RS485_HandlerCb(void);
uint32_t SensorData[3]={0};
uint8_t SendBuffer[16];
uint16_t LED_Ctrl = 0;
int main(void)
{
    HAL_Init();             				//初始化HAL库  
    Rs485_Init();										//初始化485
    UART1_Init(115200);							//初始化串口1 485总线使用
    UART2_Init(115200);							//初始化串口2
    USART3_Init(115200);						//调试串口   
    printf("this usart3 print\r\n");
    WiFi_Init();											//初始化WiFi，并连接OneNET
    while(1)
    {
        if(USART2_RX_STA>8){
            HAL_Delay(50);//延时50ms等待接收完成
            printf("get cmd=%s\r\n",USART2_RX_BUF);//调试打印
            if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED1,1")){//LED1 亮
                LED_Ctrl = 1;//灯亮控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_ON1,1,(void*)&LED_Ctrl);//发送命令控制LED1              
            }
            else if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED1,0")){//LED1 灭
                LED_Ctrl = 0;//灯灭控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_OFF1,1,(void*)&LED_Ctrl);//发送命令控制LED1                
            }    
            if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED2,1")){//LED2 亮
                LED_Ctrl = 1;//灯亮控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_ON2,1,(void*)&LED_Ctrl);//发送命令控制LED2              
            }
            else if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED2,0")){//LED2 灭
                LED_Ctrl = 0;//灯灭控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_OFF2,1,(void*)&LED_Ctrl);//发送命令控制LED2                
            } 
            if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED3,1")){//LED3 亮
                LED_Ctrl = 1;//灯亮控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_ON3,1,(void*)&LED_Ctrl);//发送命令控制LED3              
            }
            else if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED3,0")){//LED3 灭
                LED_Ctrl = 0;//灯灭控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_OFF3,1,(void*)&LED_Ctrl);//发送命令控制LED3                
            }
            if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED4,1")){//LED4 亮
                LED_Ctrl = 1;//灯亮控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_ON4,1,(void*)&LED_Ctrl);//发送命令控制LED4              
            }
            else if(strstr((void*)&USART2_RX_BUF[0],(const char*)"$LED4,0")){//LED4 灭
                LED_Ctrl = 0;//灯灭控制命令
                Rs485_Send(Addr_WiFi,Addr_LED,LED_OFF4,1,(void*)&LED_Ctrl);//发送命令控制LED1                
            }						
            USART2_RX_STA = 0;//清空串口接收计数器
            memset((void*)USART2_RX_BUF,0,USART2_REC_LEN);//清空接收缓冲
        }
    }
}





